Tekla Open API Reference for Tekla Structures 2025
LoadGroup.LoadGroupDirection Enumeration
 The possible directions.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LoadGroupDirection
Public Enumeration LoadGroupDirection
Members
Member name | Value | Description
DIR_X | 1 |  The X direction.
DIR_Y | 2 |  The Y direction.
DIR_Z | 3 |  The Z direction.
DIR_NEG_X | 4 |  The negative X direction.
DIR_NEG_Y | 5 |  The negative Y direction.
DIR_NEG_Z | 6 |  The negative Z direction.
See Also
Reference
Tekla.Structures.Model Namespace